Tekla Open API Reference for Tekla Structures 2025
GuidConversion.GetGuidMapping Method
Gets the GUID mapping.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Dictionary<Guid, Guid> GetGuidMapping()
Public Function GetGuidMapping As Dictionary(Of Guid, Guid)
Return Value
Type: Dictionary<Guid, Guid>
The GUID mapping
See Also
Reference
GuidConversion Class
Tekla.Structures.Model.Operations Namespace